# ####################################################################

#  Created by Genus(TM) Synthesis Solution 17.11-s014_1 on Fri Dec 03 11:46:42 CET 2021

# ####################################################################

set sdc_version 2.0

set_units -capacitance 1000.0fF
set_units -time 1000.0ps

# Set the current design
current_design memory_cntrll

create_clock -name "clk" -add -period 30.0 -waveform {0.0 15.0} [get_ports clk]
set_load -pin_load 1.0 [get_ports XincrMEM]
set_load -pin_load 1.0 [get_ports YincrMEM]
set_load -pin_load 1.0 [get_ports WincrMEM]
set_load -pin_load 1.0 [get_ports rstMEM]
set_load -pin_load 1.0 [get_ports WEMEM]
set_load -pin_load 1.0 [get_ports MEMEM]
set_load -pin_load 1.0 [get_ports {readOUT[7]}]
set_load -pin_load 1.0 [get_ports {readOUT[6]}]
set_load -pin_load 1.0 [get_ports {readOUT[5]}]
set_load -pin_load 1.0 [get_ports {readOUT[4]}]
set_load -pin_load 1.0 [get_ports {readOUT[3]}]
set_load -pin_load 1.0 [get_ports {readOUT[2]}]
set_load -pin_load 1.0 [get_ports {readOUT[1]}]
set_load -pin_load 1.0 [get_ports {readOUT[0]}]
set_load -pin_load 1.0 [get_ports readyOUT]
set_load -pin_load 1.0 [get_ports {curXOUT[4]}]
set_load -pin_load 1.0 [get_ports {curXOUT[3]}]
set_load -pin_load 1.0 [get_ports {curXOUT[2]}]
set_load -pin_load 1.0 [get_ports {curXOUT[1]}]
set_load -pin_load 1.0 [get_ports {curXOUT[0]}]
set_load -pin_load 1.0 [get_ports {curYOUT[4]}]
set_load -pin_load 1.0 [get_ports {curYOUT[3]}]
set_load -pin_load 1.0 [get_ports {curYOUT[2]}]
set_load -pin_load 1.0 [get_ports {curYOUT[1]}]
set_load -pin_load 1.0 [get_ports {curYOUT[0]}]
set_clock_gating_check -setup 0.0 
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {readMEM[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports clk]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {writeIN[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports WEIN]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[9]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[8]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[7]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[6]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[5]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[4]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[3]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[2]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[1]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports {AddressIN[0]}]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports GOTOIN]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports rstIN]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports clrIN]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports XincrIN]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports YincrIN]
set_input_delay -clock [get_clocks clk] -add_delay 0.2 [get_ports rstVGA]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports XincrMEM]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports YincrMEM]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports WincrMEM]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports rstMEM]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports WEMEM]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports MEMEM]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[7]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[6]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[5]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {readOUT[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports readyOUT]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curXOUT[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curXOUT[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curXOUT[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curXOUT[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curXOUT[0]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curYOUT[4]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curYOUT[3]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curYOUT[2]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curYOUT[1]}]
set_output_delay -clock [get_clocks clk] -add_delay 0.5 [get_ports {curYOUT[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {readMEM[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports clk]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {writeIN[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports WEIN]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[9]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[8]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[7]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[6]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[5]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[4]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[3]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[2]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[1]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports {AddressIN[0]}]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports GOTOIN]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports rstIN]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports clrIN]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports XincrIN]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports YincrIN]
set_driving_cell -lib_cell INVD0BWP7T -library tcb018gbwp7twc -pin "ZN" [get_ports rstVGA]
set_wire_load_mode "segmented"
set_wire_load_selection_group "WireAreaForZero" -library "tcb018gbwp7twc"
set_dont_use [get_lib_cells tcb018gbwp7twc/BHDBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GAN2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GAN2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GAOI21D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GAOI21D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GAOI22D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GBUFFD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GBUFFD2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GBUFFD3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GBUFFD8BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDCAP10BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDCAP2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDCAP3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDCAP4BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDCAPBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDFCNQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GDFQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GFILL10BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GFILL2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GFILL3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GFILL4BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GFILLBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GINVD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GINVD2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GINVD3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GINVD8BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GMUX2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GMUX2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GMUX2ND1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GMUX2ND2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GND2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GND2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GND2D3BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GND3D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GND3D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GNR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GNR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GNR3D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GNR3D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GOAI21D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GOAI21D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GOR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GOR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GSDFCNQD1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GTIEHBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GTIELBWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GXNR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GXNR2D2BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GXOR2D1BWP7T]
set_dont_use [get_lib_cells tcb018gbwp7twc/GXOR2D2BWP7T]
